CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

    convertToMeters 0.001;
    vertices  
    ( // general hex
      ( 0 0 0)		// 0
      ( 225 0 0)	// 1
      ( 225 80 0)	// 2
      ( 0 80 0)	// 3
      
      ( 0 0 99)	// 4
      ( 225 0 99)	// 5
      ( 225 80 99)	// 6
      ( 0 80 99)	// 7
      
      // inlet hex
      ( 0 0 18)	// 8
      ( 225 0 18)	// 9
      ( 225 12 18)	// 10
      ( 225 80 18)	// 11
      ( 0 80 18)	// 12
      ( 0 12 18)	// 13
      
      ( 0 0 30)	// 14
      ( 225 0 30)	// 15
      ( 225 12 30)	// 16
      ( 225 80 30)	// 17
      ( 0 80 30)	// 18
      ( 0 12 30)	// 19
      
      ( 0 12 0)        // 20
      ( 225 12 0)	// 21
      ( 225 12 99)	// 22
      ( 0 12 99)	// 23
      
      // surface
      ( 0 0 120)	// 24
      ( 225 0 120)	// 25
      ( 225 80 120)	// 26
      ( 0 80 120)	// 27
      
      ( 225 12 120)	// 28
      ( 0 12 120)	// 29
      
    );
    blocks  
    ( 
    hex
      ( 0 1 21 20 8 9 10 13)
      ( 75 4 6) 
      simpleGrading ( 1 1 1)
      
      hex
      ( 20 21 2 3 13 10 11 12)
      ( 75 13 6) 
      simpleGrading ( 1 2.5 1)
      
      hex
      ( 8 9 10 13 14 15 16 19)
      ( 75 4 4) 
      simpleGrading ( 1 1 1)
      
      hex
      ( 13 10 11 12 19 16 17 18)
      ( 75 13 4) 
      simpleGrading ( 1 2.5 1)
      
      hex
      ( 14 15 16 19 4 5 22 23)
      ( 75 4 23) 
      simpleGrading ( 1 1 1)
      
      hex
      ( 19 16 17 18 23 22 6 7)
      ( 75 13 23) 
      simpleGrading ( 1 2.5 1)
      
      hex
      ( 4 5 22 23 24 25 28 29)
      ( 75 4 7)
      simpleGrading ( 1 1 1)
      
      hex
      ( 23 22 6 7 29 28 26 27)
      ( 75 13 7)
      simpleGrading ( 1 2.5 1)
    );
    edges  
    (
    );
    boundary
(
    inlet // streamline comes from down-left side
    {
        type patch;
        faces
        (
            ( 8 13 19 14)
        );
    }
    surface
    {
        type wall;
        faces
        (
            ( 24 25 28 29)
            ( 29 28 26 27)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            //right
            (1 21 10 9)
            (21 2 11 10)
            (9 10 16 15)
            (10 11 17 16)
            (15 16 22 5)
            (16 17 6 22)
            (5 22 28 25)
            (22 6 26 28)  
        );
    }
    acrylic
    {
        type wall;
        faces
        (
            //left
            (0 20 13 8)
            (20 3 12 13)
            (13 12 18 19)
            (14 19 23 4)
            (19 18 7 23)
            (4 23 29 24)
            (23 7 27 29)
            //front
            (0 1 9 8)
            (8 9 15 14)
            (14 15 5 4)
            (4 5 25 24)
            //back
            (3 2 11 12)
            (12 11 17 18)
            (18 17 6 7)
            (7 6 26 27)
            //bottom
            (0 1 21 20)
            (20 21 2 3)
        );
    }
);
