CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet
    {
    	type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.00084;
        value           $internalField;
    }
    
    surface
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    acrylic
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
